{
    "model_type": "peneo",
    "peneo_decoder_shrink": true,
    "peneo_classifier_num_layers": 2,
    "peneo_loss_ratio": [
        1.0,
        5.0,
        5.0,
        1.0,
        1.0
    ],
    "peneo_category_weights": [
        1,
        10,
        10
    ],
    "peneo_ohem_num_positive": -1,
    "peneo_ohem_num_negative": -1,
    "peneo_downstream_speedup_ratio": 30.0,
    "backbone_name": "layoutlmv3-base",
    "backbone_config": {
        "return_dict": true,
        "output_hidden_states": false,
        "torchscript": false,
        "dtype": "float32",
        "pruned_heads": {},
        "tie_word_embeddings": true,
        "chunk_size_feed_forward": 0,
        "is_encoder_decoder": false,
        "is_decoder": false,
        "cross_attention_hidden_size": null,
        "add_cross_attention": false,
        "tie_encoder_decoder": false,
        "architectures": null,
        "finetuning_task": null,
        "id2label": {
            "0": "LABEL_0",
            "1": "LABEL_1"
        },
        "label2id": {
            "LABEL_0": 0,
            "LABEL_1": 1
        },
        "task_specific_params": null,
        "problem_type": null,
        "tokenizer_class": null,
        "prefix": null,
        "bos_token_id": 0,
        "pad_token_id": 1,
        "eos_token_id": 2,
        "sep_token_id": null,
        "decoder_start_token_id": null,
        "max_length": 20,
        "min_length": 0,
        "do_sample": false,
        "early_stopping": false,
        "num_beams": 1,
        "temperature": 1.0,
        "top_k": 50,
        "top_p": 1.0,
        "typical_p": 1.0,
        "repetition_penalty": 1.0,
        "length_penalty": 1.0,
        "no_repeat_ngram_size": 0,
        "encoder_no_repeat_ngram_size": 0,
        "bad_words_ids": null,
        "num_return_sequences": 1,
        "output_scores": false,
        "return_dict_in_generate": false,
        "forced_bos_token_id": null,
        "forced_eos_token_id": null,
        "remove_invalid_values": false,
        "exponential_decay_length_penalty": null,
        "suppress_tokens": null,
        "begin_suppress_tokens": null,
        "num_beam_groups": 1,
        "diversity_penalty": 0.0,
        "_name_or_path": "",
        "transformers_version": "4.57.3",
        "attention_probs_dropout_prob": 0.1,
        "classifier_dropout": null,
        "coordinate_size": 128,
        "has_relative_attention_bias": true,
        "has_spatial_attention_bias": true,
        "hidden_act": "gelu",
        "hidden_dropout_prob": 0.1,
        "hidden_size": 768,
        "initializer_range": 0.02,
        "input_size": 224,
        "intermediate_size": 3072,
        "layer_norm_eps": 1e-05,
        "max_2d_position_embeddings": 1024,
        "max_position_embeddings": 514,
        "max_rel_2d_pos": 256,
        "max_rel_pos": 128,
        "model_type": "",
        "num_attention_heads": 12,
        "num_hidden_layers": 12,
        "rel_2d_pos_bins": 64,
        "rel_pos_bins": 32,
        "second_input_size": 112,
        "shape_size": 128,
        "type_vocab_size": 1,
        "visual_embed": true,
        "vocab_size": 50265,
        "tf_legacy_loss": false,
        "use_bfloat16": false,
        "output_attentions": false
    }
}